quadcopter/cfd/optim_cases/design_00/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  version:     2.0;
  format:      ascii;
  class:       volScalarField;
  object:      k;
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.06;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.06;
        value           uniform 0.06;
    }
    propeller
    {
        type            kqRWallFunction;
        value           uniform 0.06;
    }
    tunnelWalls
    {
        type            slip;
    }
}
